Tekla.Structures.Analysis.UI.AnalysisObjectSelector
Get or set selected analysis objects in model views.

Tekla.Structures.Analysis.UI.AnalysisObjectSelector.#ctor
Initializes a new instance of the AnalysisObjectSelector class.

Tekla.Structures.Analysis.UI.AnalysisObjectSelector.GetSelectedObjects(System.String)
Get the analysis objects selected in model views.
analysisModelName: The analysis model name.
Returns: The analysis object enumerator of analysis objects selected in model views.

Tekla.Structures.Analysis.UI.AnalysisObjectSelector.SetSelectedObjects(System.Collections.Generic.List{Tekla.Structures.Analysis.AnalysisObject},System.Boolean)
Set analysis objects as selected in model views.
analysisObjects: The analysis objects.
append: If true, objects are added to currently selected. If false, current selection is cleared.
Returns: The count of objects selected.